{
  "mission": {
    "description": [
      "Operation Spark is a nonprofit software training center on a mission to provide opportunities for upward mobility through skills training and job placement in high-wage tech careers."
    ],
    "sections": [
      {
        "title": [
          "Who We Serve"
        ],
        "description": [
          "80% of low-income students drop out of college strapped with debt. Across the South, we have been left with thousands of young adults, ages 16 to 24, not in school and unemployed or underemployed. The impact on our communities is devastating.",
          "Meanwhile, as of June 2022, nearly 700,000 high-wage computing jobs remain unfilled across the country, while our colleges and universities graduated less than 200,000 computer science students last year.",
          "Focused on areas where generational poverty is an issue, Operation Spark delivers practical learning tools and programs that provide accessible, accelerated workforce development for high-wage careers in technology.",
          "What does that mean concretely? We teach you to write software using industrial tools, writing actual apps, and working in an awesome team environment. With six months of training, you'll be ready to launch your career as a fully autonomous, full-stack developer in the high-wage software industry."
        ]
      },
      {
        "title": [
          "A Career for Everyone"
        ],
        "description": [
          "The field of software development is quite wide. No matter your interests or aptitude, there's certainly a career for you in the software industry. You just need to build a few apps to start discovering all that software has to offer.",
          "The skills involved in building mobile video games and apps are quite varied, including application design, game mechanics and user experience, visual and sound design, computer engineering of various sorts, quality assurance, project, product and cost management, content management, and public relations of all kinds. And each of these skills leads to careers, careers with futures - for example, an entry-level quality assurance analyst is a well-paying, entry-level position that can lead to a job in management or a career as a UX designer.",
          "The Operation Spark model is simple: We introduce you to a wide set of skills and help you apply these skills in building engaging projects like mobile video games and apps. At Operation Spark, you may just discover a high-wage career that ignites your passion."
        ]
      }
    ]
  },
  "history": [
    "Started in September 2013, as a pilot project with youth community centers around New Orleans, Operation Spark taught young adults how to build simple mobile video games and apps with the goal of igniting the pursuit of an employable passion. These early experiments led to a robust High-School to High-Wage software training program for public school students across Louisiana. Coupled with an extensive summer teacher academy that prepares educators to offer our curriculum in their local classrooms, Operation Spark annually engages over 600 young people in exploring software careers.",
    "In 2015, Operation Spark partnered with Hack Reactor in San Francisco to develop an adult workforce program, Immersion, graduating its first class in January 2016. Later that year, we were granted a license by the Louisiana Board of Regents to operate as a proprietary school offering Industry-Based Credentials in JavaScript, Functional Programming, and Web Development (Levels 1, 2, and 3). Operation Spark graduates are now applying their career-changing skills worldwide at companies like LinkedIn, UbiSoft, DXC, GE, the Australian Broadcasting Corporation, and PayPal. ",
    "Today, Operation Spark is an approved training provider with the Louisiana Department of Education and the Louisiana Workforce Commission, providing in-demand software training programs for high school students, teachers, and adult learners across the Southeast."
  ],
  "team": {
    "staff": [
      {
        "name": "John Fraboni",
        "role": "Founder and CEO",
        "image": "/images/people/staff/john-fraboni.jpg",
        "contact": {
          "email": "john@operationspark.org",
          "phone": "504.534.8277"
        },
        "about": [
          "John has 24 years of professional experience in software development, having worked for a diverse set of clients including, Tabasco, Tulane University, Riley Foods, Oreck Vacuums, The Canadian Imperial Bank of Commerce, Microsoft, Ernst and Young, Disney, and Sony. Beginning in 2009, his work in the video game industry in Montreal contributed to some of the most successful games on social platforms.",
          "Mr. Fraboni holds a Bachelor of Music from McGill University and a Master of Music degree from the Manhattan School of Music. He is also the recipient of performing arts awards from the Canada Council for the Arts, the Ontario Arts Council, the Manhattan School of Music, International House New York, as well as the Canadian Academy of Recording Arts and Sciences (a Juno award, the Canadian equivalent of Grammy).",
          "He has lived in Montreal, New York, New Orleans, and Toronto."
        ]
      },
      {
        "name": "Kim Farrell",
        "role": "Director of Finance and Operations",
        "image": "/images/people/staff/kim-farrell.jpg",
        "about": [
          "Born in Ohio and raised in New Orleans. Kim spent many years in the legal and law enforcement fields before transitioning to a career in finance. She loves giving back and supporting her community, which ultimately led to her Operation Spark.",
          "Kim has a love for history and everything New Orleans. When she's not working, you can find her outside in her garden or painting and creating art. If you look closely, you can even find her dressed for the occasion and parading through the streets of New Orleans with the Krewe of the Rolling Elvi."
        ]
      },
      {
        "name": "Mayukh Raychaudhuri",
        "role": "Director of High School Programs",
        "image": "/images/people/staff/mayukh-raychaudhuri.jpg",
        "about": [
          "Mayukh is passionate about empowering individuals and communities through access to innovative educational opportunities. He began his professional career as an attorney for multiple Philadelphia law firms working on large-scale class action litigations. After moving to New Orleans in 2013, he spent five years teaching English and Math for KIPP, Firstline, and Jefferson Parish Schools.",
          "Mayukh holds a Bachelor's degree in English from the University of Michigan and a J.D. from Rutgers University. Outside of work, he enjoys spicy food, travel, and the films of Spike Lee, Richard Linklater, and Pedro Almodovar."
        ]
      },
      {
        "name": "Harvey Sanders",
        "role": "Director of Adult Instruction / Software Engineer",
        "image": "/images/people/staff/harvey-sanders.jpg",
        "about": [
          "Harvey has a passion for learning, teaching and using technology. He focuses on producing exciting and effective web applications through Operation Spark's software development shop. Prior to creating software with Operation Spark, Harvey introduced underserved youth to web development through the Work & Learn Program at the Youth Empowerment Project. As Assistant Director of Work & Learn, Harvey also established two businesses with a goal of giving youth valuable job and life skills.",
          "Harvey is a graduate of Operation Spark's Immersion program and holds a Bachelor's Degree in Marketing from Grand Valley State University in his hometown of Grand Rapids, Michigan."
        ]
      },
      {
        "name": "Daniel Kogler",
        "role": "Instructor / Software Engineer",
        "image": "/images/people/staff/daniel-kogler.jpg",
        "about": [
          "Daniel is a Baton Rouge local with over 20 years of programming experience. A graduate from Tulane University in Electrical Engineering, he went on to receive a Masters and PhD in Computer Science from Indiana University. A long time citizen of the world of academia, he has moved on from being simply a learner to also a teacher, as he believes that a strong education regarding technology is important in today's computer-driven society. Upon discovering Operation Spark, he knew that he'd found a place where he could reach youth who might otherwise not receive exposure to programming, and has since taken up a position as the lead instructor in the Baton Rouge area."
        ]
      },
      {
        "name": "Johnnie James II",
        "role": "Operations Coordinator",
        "image": "/images/people/staff/johnnie-james-ii.jpg",
        "about": [
          "Johnnie is an entrepreneur with experience in non-profits, real estate, live event production and more. He has college and technical training from Florida A&M - Business, the University of New Mexico - Urban Planning, Tulane - Public Relations, and Operation Spark - software engineering.",
          "He is an advocate for justice, a poet, a consultant, an actor and a former concert promoter. Among many other diverse roles and responsibilities, Johnnie has volunteered for organizations such as School of Rock, PlayBuild NOLA, NOTEP, and Operation Spark underscoring his personal commitment to STEAM education principles.",
          "In his free time, Johnnie can often be found cooking, watching pro wrestling or mma, or tending to one of he and his wife's five animals at home."
        ]
      },
      {
        "name": "Taylor Shephard",
        "role": "Instructor / Software Engineer",
        "image": "/images/people/staff/taylor-shephard.jpg",
        "about": [
          "Taylor Shephard was born and raised in New Orleans, Louisiana. She graduated from St. Mary’s Academy High School in New Orleans East in 2014 and then headed to Southeastern Louisiana University to further her studies for a couple years. She attempted to teach herself html and css because she was always very interested in knowing what it takes to make websites. Soon after she found Operation Spark where Taylor gained her passion for coding. She completed Operation Spark's immersion program in July 2018.",
          "Soon after completing the program, Taylor joined the Operation Spark team as an instructor. She really enjoys helping others learn to code, watching their skills grow, and witnessing them become awesome software engineers. Her interests include traveling, photography, fashion, coding, learning new things, and making a difference. "
        ]
      },
      {
        "name": "Greg Thompson",
        "role": "Instructor / Software Engineer",
        "image": "/images/people/staff/greg-thompson.jpg",
        "about": [
          "Greg is a New Orleans native who graduated from Ben Franklin High School and then headed across town to study education at Tulane. After finding a passion working with robotics, he spent five years teaching high school and middle school engineering, robotics, computer science, and math. He completed Operation Spark's Immersion program in the fall of 2020 and is now part of the high school team at Operation Spark.",
          "In his spare time, Greg enjoys running with former students at Youth Run NOLA events, playing board games and solving logic puzzles, and baking up a storm in the kitchen."
        ]
      },
      {
        "name": "Akintunde Pounds",
        "role": "Instructor / Software Engineer",
        "image": "/images/people/staff/akintunde-pounds.png",
        "about": [
          "Originally from the Midwest, Akin moved to New Orleans as a child. As a kid, Akin always wanted to make software such as video games and mobile applications, but believed he could not learn the necessary programming skills to be a software developer. That all changed after he attended and graduated Operation Spark to become a professional software developer. Akin has been an instructor at Operation Spark for over two years and was previously a software developer at Revelry Labs. Some of Akin's favorite hobbies include; exploring open-source technology, developing video games, and producing music."
        ]
      },
      {
        "name": "Jessalyn Daggs",
        "role": "Student Success Coordinator / Software Engineer",
        "image": "/images/people/staff/jessalyn-daggs.jpg",
        "about": [
          "Jessalyn is from Thibodaux, LA and believes that the opportunity Operation Spark brings to New Orleanians can provide new possibilities for the entire Southeast region and beyond. After more than 10 years managing retail businesses, she sought out a career that would allow her to be mother to her newborn first, while exploring her passion for design thinking and problem solving.",
          "She graduated from Operation Spark in 2020 and accepted her dream job as a part of the Opspark team aiding students in overcoming challenges and celebrating wins while navigating our program from beginning their training to being hired in tech. She believes we can change the status quo when we inspire others to go beyond what's already been established. Her hope is that New Orleans' black women and girls continue to explore the value that they bring to the technology landscape and dare to take up space in the tech economy."
        ]
      },
      {
        "name": "Alex Aaron",
        "role": "Instructor / Software Engineer",
        "image": "/images/people/staff/alex-aaron.jpg",
        "about": [
          "A native of Baton Rouge, Louisiana, Alex has resided in New Orleans since 2006. He first encountered Operation Spark as a high school educator when he participated in Operation Spark's educator training. He then administered the organization's innovative high school curriculum to sophomores at Abramson Sci Academy. Unsurprisingly, Alex caught the coding bug himself and decided to pursue software development as a career. After graduating from Flatiron Software Development Bootcamp, Alex was hired by Operation Spark as the pre-qualifying bootcamp instructor. As bootcamp instructor, Alex works closely with students who are early in their software developmet journey, providing in-depth intermediate-to-advanced JavaScript instruction."
        ]
      },
      {
        "name": "Patrice Williams",
        "role": "Instructor / Software Engineer",
        "image": "/images/people/staff/patrice-williams.jpg",
        "about": [
          "Patrice is a native of New Orleans, LA. She graduated from Xavier University of LA in 2012, where she received her Bachelor's in Biology. In 2015, she received a Master's in Public  Health from LSU Health Sciences Center specializing in Behavioral and Community Health.",
          "After working as a Student Success Specialist at Xavier University of LA, then transitioning to the Mortgage industry, Patrice was ready to try something new. She graduated from Operation Spark in 2021 and now works there as a software developer and instructor.",
          "Her hobbies include taking her kids on new adventures, playing with her dogs, coding, and watching movies. Patrice loves helping her students learn to code and watch as they blossom into amazing software engineers. "
        ]
      },
      {
        "name": "Caity Opelka",
        "role": "Instructor / Software Engineer",
        "image": "/images/people/staff/caity-opelka.jpg",
        "about": [
          "Caity grew up in New Orleans and was always drawn to the Arts. She studied Graphic Design and Photography at Savannah College of Art & Design and has a decade of experience designing and marketing in the Events and Food & Beverage industries. As she regularly worked alongside developers, she was intrigued by the coding aspect and decided to enroll in a bootcamp. After graduating from Operation Spark's Immersion Program in 2021, Caity joined the team as a software engineer and instructor. She enjoys sharing in the excitement of students working together to build their first applications from scratch as a team as well as setting them up for success in preparation for their entry into the workforce."
        ]
      },
      {
        "name": "Peter Barnum",
        "role": "Instruction Lead / Software Engineer",
        "image": "/images/people/staff/peter-barnum.jpg",
        "about": [
          "Peter grew up in Denver, Colorado, and has always been passionate about technology, computer science, and teaching others these valuable skills. In his early years, Peter realized that the internet was a powerful resource for learning about technology and code. Teaching himself to code has provided a high level of autonomy and problem-solving, fundamental in software development.",
          "Peter loves problem-solving and coding, spending most of his free time working on one project or another. Whether creating services to automate tasks, building out new applications/websites, or exploring new technologies, he spends most of his time expanding his knowledge."
        ]
      },
      {
        "name": "Jessica Torres",
        "role": "Instructor / Software Engineer",
        "image": "/images/people/staff/jessica-torres.jpg",
        "about": [
          "Jessica is a Louisiana native whose pursuit of new and interesting things has taken her across many unrelated industries.",
          "Before deciding to begin Operation Spark as a student herself, she had attended LSU for Biomedical Engineering, bartended at craft cocktail ___, worked as a medical assistant in orthopedic surgery, started a career as a train mechanic, and trained as a car photographer.",
          "It only took the first days of the Prep phase, here, to make her realize that she had finally found a lasting home in programming.",
          "The around the clock opportunities for innovative problem solving, continued learning, and infinite possibilities in the realm of creation combined the best parts of each past career (and if she takes her laptop to the backyard, she even gets to work outdoors again). Jessica applies experience from each previous discipline in her teaching of the Junior phase and works to identify and meet the way that each student learns best.",
          "In her free time, she still enjoys welding+woodworking, cooking, and has been teaching herself 3D Development."
        ]
      }
    ],
    "directors": [
      {
        "name": "Max Gaudin, Chair",
        "role": "Head of Growth, Soul Addict"
      },
      {
        "name": "Brandon Davis",
        "role": "Partner, Phelps Dunbar"
      },
      {
        "name": "Chris LeBato",
        "role": "CEO, MC Bank New Orleans"
      }
    ]
  },
  "awards": [
    {
      "title": "Cloud Academy: How Operation Spark leverages Cloud Academy to build tech talent in New Orleans",
      "url": "https://cloudacademy.com/case-studies/operation-spark/"
    },
    {
      "title": "WGNO News: New Orleans Camp for Computer Kids",
      "url": "https://drive.google.com/file/d/1EMPS4lPRMt_wtmS6wi9Pt9HCa9Pw2e0r/view"
    },
    {
      "title": "Entergy gives $1 million to support Louisiana workforce training",
      "url": "http://www.nola.com/business/index.ssf/2016/11/entergy_gives_1_million_in_gra.html"
    },
    {
      "title": "Three Ways Philanthropists Can Invest In Markets To Revive The American Dream",
      "url": "http://www.forbes.com/sites/bridgespan/2016/06/08/three-ways-philanthropists-can-invest-in-markets-to-revive-the-american-dream/#23f23b392ba1"
    },
    {
      "title": "New Orleans non-profit attends first White House Tech Meetup",
      "url": "http://www.theadvocate.com/baton_rouge/news/politics/article_4309e250-4e61-51e8-974c-a50c5f0b92d3.html"
    },
    {
      "title": "Operation Spark Wins Big for New Orleans Youth",
      "url": "http://www.nola.com/business/index.ssf/2014/08/education_entrepreneurship_con.html"
    },
    {
      "title": "Apprenticing, with Operation Spark and Silicon Bayou News",
      "url": "http://siliconbayounews.com/2014/07/31/apprenticeship-program-for-software-development-stimulates-student-learning-in-new-orleans"
    }
  ]
}
